dacalleg/micropython/ports/esp32/boards/NAVEL/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "ESP32 module (navel)"
#define MICROPY_HW_MCU_NAME "ESP32"
